# Create Features for Transformation

In [1]:
import pandas as pd
import numpy as np

Read sample data

In [2]:
df = pd.read_csv("data/syn_marriot_data.csv")

In [3]:
df.head()

,scorupdt00_id,client_name,member_key,paid_amount,insert_date,patient_dob,icd1,icd2,icd3,icd4,icd5,server,database
0,2450901,MARRIOT,848191,1989.01,2022-7-02 5:18:36.036,1982-3-07,S99922A,S61209A,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
1,2450901,MARRIOT,971572,6787.77,2022-1-12 19:49:44.044,1994-3-15,G544,M05872,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
2,2450901,MARRIOT,676508,3165.36,2022-7-21 15:34:38.038,2001-9-27,P929,S86212A,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
3,2450901,MARRIOT,947758,2493.95,2022-8-05 10:31:59.059,2020-11-08,S62101D,J9589,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
4,2450901,MARRIOT,983055,3287.50,2022-9-05 8:41:56.056,2012-3-22,C4442,NaN,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI

In [4]:
df.dtypes

scorupdt00_id      int64
client_name       object
member_key         int64
paid_amount      float64
insert_date       object
patient_dob       object
icd1              object
icd2              object
icd3              object
icd4              object
icd5              object
server            object
database          object
dtype: object

In [5]:
df.size

13000000

In [6]:
df.shape

(1000000, 13)

In [7]:
df["scorupdt00_id"].value_counts()

2450901    1000000
Name: scorupdt00_id, dtype: int64

In [8]:
df["client_name"].value_counts()

MARRIOT    1000000
Name: client_name, dtype: int64

In [9]:
df["server"].value_counts()

DEN06SQL04    1000000
Name: server, dtype: int64

In [10]:
df["database"].value_counts()

INS_POSTPAY_MARRIOTT_MULTI    1000000
Name: database, dtype: int64

columns: scorupdt00_id, client_name, server, database have only 1 unique value.

In [11]:
df.isnull().sum(axis=0)

scorupdt00_id         0
client_name           0
member_key            0
paid_amount           0
insert_date           0
patient_dob           0
icd1                  0
icd2             299972
icd3             499910
icd4             699923
icd5             899282
server                0
database              0
dtype: int64

In [12]:
df.shape

(1000000, 13)

Null values in each column

In [13]:
df.describe()

       scorupdt00_id      member_key     paid_amount
count      1000000.0  1000000.000000  1000000.000000
mean       2450901.0   800093.247326     5006.198137
std              0.0   115464.912688     2884.347923
min        2450901.0   600000.000000       10.000000
25%        2450901.0   700070.750000     2509.505000
50%        2450901.0   800164.000000     5005.225000
75%        2450901.0   900072.000000     7503.892500
max        2450901.0   999999.000000    10000.000000

In [14]:
df.paid_amount.describe()

count    1000000.000000
mean        5006.198137
std         2884.347923
min           10.000000
25%         2509.505000
50%         5005.225000
75%         7503.892500
max        10000.000000
Name: paid_amount, dtype: float64

Insight for paid_amount

In [15]:
df.columns

Index(['scorupdt00_id', 'client_name', 'member_key', 'paid_amount',
       'insert_date', 'patient_dob', 'icd1', 'icd2', 'icd3', 'icd4', 'icd5',
       'server', 'database'],
      dtype='object')

### Parameters

In [16]:
icd_columns = ["icd1","icd2","icd3","icd4","icd5"]

what is icd_categories ?
icd_categories = ?

In [17]:
icd_categories = ["S61","J95","C44","M51","Z12"]

In [18]:
primary_key = "member_key"

### extract_category_codes

In [19]:
for col in icd_columns:
    df[col] = df[col].str[:3]
df

,scorupdt00_id,client_name,member_key,paid_amount,insert_date,patient_dob,icd1,icd2,icd3,icd4,icd5,server,database
0,2450901,MARRIOT,848191,1989.01,2022-7-02 5:18:36.036,1982-3-07,S99,S61,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
1,2450901,MARRIOT,971572,6787.77,2022-1-12 19:49:44.044,1994-3-15,G54,M05,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
2,2450901,MARRIOT,676508,3165.36,2022-7-21 15:34:38.038,2001-9-27,P92,S86,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
3,2450901,MARRIOT,947758,2493.95,2022-8-05 10:31:59.059,2020-11-08,S62,J95,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
4,2450901,MARRIOT,983055,3287.50,2022-9-05 8:41:56.056,2012-3-22,C44,NaN,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
...,...,...,...,...,...,...,...,...,...,...,...,...,...
999995,2450901,MARRIOT,791106,2145.93,2022-5-16 9:38:31.031,1997-8-04,F90,S90,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
999996,2450901,MARRIOT,833073,775.75,2022-8-16 0:04:59.059,1976-6-07,S06,NaN,NaN,NaN,S82,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
999997,2450901,MARRIOT,892676,9588.92,2022-11-24 18:10:21.021,1989-4-09,S43,M12,NaN,Z12,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
999998,2450901,MARRIOT,634951,2128.62,2022-11-19 12:59:29.029,1975-10-26,S79,NaN,B97,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI
999999,2450901,MARRIOT,877332,7133.88,2022-8-04 3:00:44.044,2021-1-26,R89,M51,NaN,NaN,NaN,DEN06SQL04,INS_POSTPAY_MARRIOTT_MULTI

Scala Spark Eqivalent is in /desktop/tpl/sparkscala.

### dummy_code_icd_codes

#### Part 1

In [20]:
columns = [primary_key] + icd_columns
columns

['member_key', 'icd1', 'icd2', 'icd3', 'icd4', 'icd5']

Converts primary_key which is initially a string into list and concats withs icd_columns

In [21]:
df_claims_icd = df[columns]

In [22]:
df_claims_icd.head()

   member_key icd1 icd2 icd3 icd4 icd5
0      848191  S99  S61  NaN  NaN  NaN
1      971572  G54  M05  NaN  NaN  NaN
2      676508  P92  S86  NaN  NaN  NaN
3      947758  S62  J95  NaN  NaN  NaN
4      983055  C44  NaN  NaN  NaN  NaN

Joins the member_key column and icd_columns

In [23]:
df_claims_icd.set_index(primary_key)

           icd1 icd2 icd3 icd4 icd5
member_key
848191      S99  S61  NaN  NaN  NaN
971572      G54  M05  NaN  NaN  NaN
676508      P92  S86  NaN  NaN  NaN
947758      S62  J95  NaN  NaN  NaN
983055      C44  NaN  NaN  NaN  NaN
...         ...  ...  ...  ...  ...
791106      F90  S90  NaN  NaN  NaN
833073      S06  NaN  NaN  NaN  S82
892676      S43  M12  NaN  Z12  NaN
634951      S79  NaN  B97  NaN  NaN
877332      R89  M51  NaN  NaN  NaN

[1000000 rows x 5 columns]

Sets the member_key column as the index.

Let us now create a test DataFrame in the following steps.

In [24]:
test = df_claims_icd.set_index(primary_key)

In [25]:
test.where(lambda x: x.isin(icd_categories))

           icd1 icd2 icd3 icd4 icd5
member_key
848191      NaN  S61  NaN  NaN  NaN
971572      NaN  NaN  NaN  NaN  NaN
676508      NaN  NaN  NaN  NaN  NaN
947758      NaN  J95  NaN  NaN  NaN
983055      C44  NaN  NaN  NaN  NaN
...         ...  ...  ...  ...  ...
791106      NaN  NaN  NaN  NaN  NaN
833073      NaN  NaN  NaN  NaN  NaN
892676      NaN  NaN  NaN  Z12  NaN
634951      NaN  NaN  NaN  NaN  NaN
877332      NaN  M51  NaN  NaN  NaN

[1000000 rows x 5 columns]

Creates null values where icd_categories != (any of the icd columns)

In [26]:
test = test.where(lambda x: x.isin(icd_categories))

In [27]:
test.stack

<bound method DataFrame.stack of            icd1 icd2 icd3 icd4 icd5
member_key
848191      NaN  S61  NaN  NaN  NaN
971572      NaN  NaN  NaN  NaN  NaN
676508      NaN  NaN  NaN  NaN  NaN
947758      NaN  J95  NaN  NaN  NaN
983055      C44  NaN  NaN  NaN  NaN
...         ...  ...  ...  ...  ...
791106      NaN  NaN  NaN  NaN  NaN
833073      NaN  NaN  NaN  NaN  NaN
892676      NaN  NaN  NaN  Z12  NaN
634951      NaN  NaN  NaN  NaN  NaN
877332      NaN  M51  NaN  NaN  NaN

[1000000 rows x 5 columns]>

In [28]:
test.stack()

member_key
848191      icd2    S61
947758      icd2    J95
983055      icd1    C44
603473      icd3    S61
611093      icd2    S61
                   ...
780092      icd1    S61
925225      icd3    S61
947425      icd3    M51
892676      icd4    Z12
877332      icd2    M51
Length: 38892, dtype: object

Here, it removes the rows that have null values in every icd_columns.

In [29]:
test.stack().str.get_dummies()

                 C44  J95  M51  S61  Z12
member_key
848191     icd2    0    0    0    1    0
947758     icd2    0    1    0    0    0
983055     icd1    1    0    0    0    0
603473     icd3    0    0    0    1    0
611093     icd2    0    0    0    1    0
...              ...  ...  ...  ...  ...
780092     icd1    0    0    0    1    0
925225     icd3    0    0    0    1    0
947425     icd3    0    0    1    0    0
892676     icd4    0    0    0    0    1
877332     icd2    0    0    1    0    0

[38892 rows x 5 columns]

Creates dummy values(i.e 1) for those icd_values that contain atleast one icd_categories and the rest is zero(0).

In [30]:
test = test.stack().str.get_dummies()

In [31]:
test.groupby(primary_key).max()

            C44  J95  M51  S61  Z12
member_key
600002        0    0    1    0    0
600007        0    0    0    1    0
600012        0    0    0    1    0
600013        0    0    1    0    0
600041        0    0    1    0    0
...         ...  ...  ...  ...  ...
999913        0    0    0    1    0
999921        0    0    0    1    0
999939        0    0    0    1    0
999956        0    0    0    1    0
999961        1    0    0    0    0

[36521 rows x 5 columns]

This performs a groupby function using primary_key = "member_key" and returns the max() agg where for each icd there is max 1 value. i.e if 6 icd values are true then only max 5 icd_column values are retuned.

------------------------------------------------------------------ Analysing code ------------------------------------------------------------------

In [32]:
df.loc[df["member_key"]==600012].where(lambda x: x.isin(icd_categories)).stack().str.get_dummies()

             S61
793560 icd2    1
894361 icd3    1

This checks how many icd_codes a member_key has.

In [33]:
df.loc[df["member_key"]==600012].where(lambda x: x.isin(icd_categories)).stack().str.get_dummies().max()

S61    1
dtype: int64

This gives the max times icd_codes mentioned

------------------------------------------------------------------ Analysing code ------------------------------------------------------------------

In [34]:
test = test.groupby(primary_key).max()

In [35]:
test.reindex(columns=icd_categories, fill_value=0)

            S61  J95  C44  M51  Z12
member_key
600002        0    0    0    1    0
600007        1    0    0    0    0
600012        1    0    0    0    0
600013        0    0    0    1    0
600041        0    0    0    1    0
...         ...  ...  ...  ...  ...
999913        1    0    0    0    0
999921        1    0    0    0    0
999939        1    0    0    0    0
999956        1    0    0    0    0
999961        0    0    1    0    0

[36521 rows x 5 columns]

In [36]:
icd_categories

['S61', 'J95', 'C44', 'M51', 'Z12']

This reindex the DataFrame according to icd_categories.

In [39]:
df_result_1 = test.reindex(columns=icd_categories, fill_value=0)

In [40]:
df_result_1.shape

(36521, 5)

We see that the shape has changed from 1000000 rows. Here icd_columns are transformed into icd_categories and create a 0 and 1 feature for each icd_categories.

So, What is happenning here is that we are:
- creating a DataFrame with member_key as index and icd_columns
- setting member_key as index to exclude it from row operations
- setting null where icd_column[values] != icd_categories[values*]
- stacking transposes the DataFrame and removes those rows which have all null values. Stack(level=,dropna=). dropna is true by default.
- get dummies creates dummy values, i.e 1 if value exists else 0 on top of stack.
- performing a groupby function using primary_key = "member_key" and returning max() i.e max 1 row for each icd values holding true for icd_categories. i.e if 6 icd values are true then only max 5 icd_column values are retuned since icd_column[] contains 5 valus.
- reindex(columns=icd_categories, fill_value=0) places the columns in order of the list icd_categories.

#### Part 2

In [63]:
key_with_no_matching_icds = set(df[primary_key]) - set(df_result_1.index)

Code Breakdown:

In [59]:
len(set(df[primary_key]))

367178

In [60]:
len(set(df_result_1.index))

36521

set puts DataFrame column in a set to remove duplicate values

In [64]:
pd.DataFrame(0, index=key_with_no_matching_icds, columns=icd_categories)

        S61  J95  C44  M51  Z12
600000    0    0    0    0    0
600001    0    0    0    0    0
600003    0    0    0    0    0
600004    0    0    0    0    0
600005    0    0    0    0    0
...     ...  ...  ...  ...  ...
999992    0    0    0    0    0
999993    0    0    0    0    0
999994    0    0    0    0    0
999995    0    0    0    0    0
999999    0    0    0    0    0

[330657 rows x 5 columns]

In [67]:
df_result_2 = pd.DataFrame(0, index=key_with_no_matching_icds, columns=icd_categories)

Creating DataFrame with member_key and icd_categories and inserting 0 for every value.

In [71]:
df_result_2.index.name = primary_key

Setting the index name for df_result_2 as member_key

In [74]:
assert len(set(df_result_2.index).intersection(set(df_result_1.index))) == 0

The above code is testing if len any row of df_result_2 exists in df_result_1

In [75]:
pd.concat([df_result_1, df_result_2])

            S61  J95  C44  M51  Z12
member_key
600002        0    0    0    1    0
600007        1    0    0    0    0
600012        1    0    0    0    0
600013        0    0    0    1    0
600041        0    0    0    1    0
...         ...  ...  ...  ...  ...
999992        0    0    0    0    0
999993        0    0    0    0    0
999994        0    0    0    0    0
999995        0    0    0    0    0
999999        0    0    0    0    0

[367178 rows x 5 columns]

In [76]:
df_processed = pd.concat([df_result_1, df_result_2])

Concatinating df_result_1 and df_result_2

In [77]:
assert df[primary_key].nunique() == (df_processed.shape[0])

In [83]:
df[primary_key].nunique()

367178

In [87]:
df_processed.shape[0]

367178

Testing if number of unique member_keys == length of the df_processed

So, What is happenning here is that we are:
- Finding member_keys that does not exists in df_result_1
- Creating DataFrame and making those member_key as index and icd_categories as columns
- inserting 0 in icd_categories values
- checking if any member_key of df_result_1 exists in df_result_2
- merging the two DataFrames(df_result_1, df_result_2) to create the original whole DataFrame
- testing if orginal df member_key unique values == df_processed member_key

# Convert scala spark code